In [38]:
import numpy as np
import pandas as pd
import os

In [91]:
niftySingle = pd.read_csv('niftySingle.csv', usecols=['Date', 'Close'], index_col='Date')
niftySingle.rename(columns={'Close' : 'niftyPrice'},inplace=True)
niftySingle.insert(0,'company', 'nifty50')
niftySingle

            company    niftyPrice
Date
2012-01-03  nifty50   4765.299805
2012-01-04  nifty50   4749.649902
2012-01-05  nifty50   4749.950195
2012-01-06  nifty50   4754.100098
2012-01-09  nifty50   4742.799805
...             ...           ...
2023-04-26  nifty50  17813.599609
2023-04-27  nifty50  17915.050781
2023-04-28  nifty50  18065.000000
2023-05-02  nifty50  18147.650391
2023-05-03  nifty50  18089.849609

[2778 rows x 2 columns]

## listing all companies

In [44]:
list_of_companies = os.listdir('C:\\keshav\\Navneet_sir_all\\Nifty50_dashboard_levels\\Nifty50_Data')
list_of_companies

['ADANIENT.NS.csv',
 'ADANIPORTS.NS.csv',
 'APOLLOHOSP.NS.csv',
 'ASIANPAINT.NS.csv',
 'AXISBANK.NS.csv',
 'BAJAJ-AUTO.NS.csv',
 'BAJAJFINSV.NS.csv',
 'BAJFINANCE.NS.csv',
 'BHARTIARTL.NS.csv',
 'BPCL.NS.csv',
 'BRITANNIA.NS.csv',
 'CIPLA.NS.csv',
 'COALINDIA.NS.csv',
 'DIVISLAB.NS.csv',
 'DRREDDY.NS.csv',
 'EICHERMOT.NS.csv',
 'GRASIM.NS.csv',
 'HCLTECH.NS.csv',
 'HDFC.NS.csv',
 'HDFCBANK.NS.csv',
 'HDFCLIFE.NS.csv',
 'HEROMOTOCO.NS.csv',
 'HINDALCO.NS.csv',
 'HINDUNILVR.NS.csv',
 'ICICIBANK.NS.csv',
 'INDUSINDBK.NS.csv',
 'INFY.NS.csv',
 'ITC.NS.csv',
 'JSWSTEEL.NS.csv',
 'KOTAKBANK.NS.csv',
 'LT.NS.csv',
 'M&M.NS.csv',
 'MARUTI.NS.csv',
 'NESTLEIND.NS.csv',
 'NTPC.NS.csv',
 'ONGC.NS.csv',
 'POWERGRID.NS.csv',
 'RELIANCE.NS.csv',
 'SBILIFE.NS.csv',
 'SBIN.NS.csv',
 'SUNPHARMA.NS.csv',
 'TATACONSUM.NS.csv',
 'TATAMOTORS.NS.csv',
 'TATASTEEL.NS.csv',
 'TCS.NS.csv',
 'TECHM.NS.csv',
 'TITAN.NS.csv',
 'ULTRACEMCO.NS.csv',
 'UPL.NS.csv',
 'WIPRO.NS.csv']

## setting up one comapny

In [92]:
df = pd.read_csv(f'C:\\keshav\\Navneet_sir_all\\Nifty50_dashboard_levels\\Nifty50_Data\\{list_of_companies[0]}', usecols=['Date','Close'], index_col = 'Date')
df.rename(columns={'Close' : 'price'}, inplace=True)
company_name = f"{list_of_companies[0].split('.')[0]}"
df.insert(0,'company',company_name)
df

             company        price
Date
2012-01-02  ADANIENT    44.242844
2012-01-03  ADANIENT    44.043587
2012-01-04  ADANIENT    42.633457
2012-01-05  ADANIENT    40.939770
2012-01-06  ADANIENT    41.162018
...              ...          ...
2023-04-25  ADANIENT  1844.599976
2023-04-26  ADANIENT  1847.900024
2023-04-27  ADANIENT  1853.050049
2023-04-28  ADANIENT  1924.949951
2023-05-02  ADANIENT  1950.949951

[2793 rows x 2 columns]

## merging with nifty50

In [95]:
dff = pd.merge(niftySingle,df,left_index=True, right_index=True)
dff

           company_x    niftyPrice company_y        price
Date
2012-01-03   nifty50   4765.299805  ADANIENT    44.043587
2012-01-04   nifty50   4749.649902  ADANIENT    42.633457
2012-01-05   nifty50   4749.950195  ADANIENT    40.939770
2012-01-06   nifty50   4754.100098  ADANIENT    41.162018
2012-01-09   nifty50   4742.799805  ADANIENT    41.047058
...              ...           ...       ...          ...
2023-04-25   nifty50  17769.250000  ADANIENT  1844.599976
2023-04-26   nifty50  17813.599609  ADANIENT  1847.900024
2023-04-27   nifty50  17915.050781  ADANIENT  1853.050049
2023-04-28   nifty50  18065.000000  ADANIENT  1924.949951
2023-05-02   nifty50  18147.650391  ADANIENT  1950.949951

[2777 rows x 4 columns]

##  calculating --Ratio, Mean, SD

In [100]:
dff['ratio'] = dff['niftyPrice']/dff['price']

In [101]:
dff

           company_x    niftyPrice company_y        price       ratio
Date
2012-01-03   nifty50   4765.299805  ADANIENT    44.043587  108.195089
2012-01-04   nifty50   4749.649902  ADANIENT    42.633457  111.406633
2012-01-05   nifty50   4749.950195  ADANIENT    40.939770  116.022885
2012-01-06   nifty50   4754.100098  ADANIENT    41.162018  115.497256
2012-01-09   nifty50   4742.799805  ADANIENT    41.047058  115.545426
...              ...           ...       ...          ...         ...
2023-04-25   nifty50  17769.250000  ADANIENT  1844.599976    9.633118
2023-04-26   nifty50  17813.599609  ADANIENT  1847.900024    9.639915
2023-04-27   nifty50  17915.050781  ADANIENT  1853.050049    9.667872
2023-04-28   nifty50  18065.000000  ADANIENT  1924.949951    9.384660
2023-05-02   nifty50  18147.650391  ADANIENT  1950.949951    9.301956

[2777 rows x 5 columns]

In [104]:
dff['mean'] = dff['ratio'].mean()

In [105]:
dff

,company_x,niftyPrice,company_y,price,ratio,mean
Date,,,,,,
2012-01-03,nifty50,4765.299805,ADANIENT,44.043587,108.195089,105.424814
2012-01-04,nifty50,4749.649902,ADANIENT,42.633457,111.406633,105.424814
2012-01-05,nifty50,4749.950195,ADANIENT,40.939770,116.022885,105.424814
2012-01-06,nifty50,4754.100098,ADANIENT,41.162018,115.497256,105.424814
2012-01-09,nifty50,4742.799805,ADANIENT,41.047058,115.545426,105.424814
...,...,...,...,...,...,...
2023-04-25,nifty50,17769.250000,ADANIENT,1844.599976,9.633118,105.424814
2023-04-26,nifty50,17813.599609,ADANIENT,1847.900024,9.639915,105.424814
2023-04-27,nifty50,17915.050781,ADANIENT,1853.050049,9.667872,105.424814
2023-04-28,nifty50,18065.000000,ADANIENT,1924.949951,9.384660,105.424814
2023-05-02,nifty50,18147.650391,ADANIENT,1950.949951,9.301956,105.424814

In [107]:
dff['std'] = dff['ratio'].std()

In [108]:
dff

,company_x,niftyPrice,company_y,price,ratio,mean,std
Date,,,,,,,
2012-01-03,nifty50,4765.299805,ADANIENT,44.043587,108.195089,105.424814,68.843221
2012-01-04,nifty50,4749.649902,ADANIENT,42.633457,111.406633,105.424814,68.843221
2012-01-05,nifty50,4749.950195,ADANIENT,40.939770,116.022885,105.424814,68.843221
2012-01-06,nifty50,4754.100098,ADANIENT,41.162018,115.497256,105.424814,68.843221
2012-01-09,nifty50,4742.799805,ADANIENT,41.047058,115.545426,105.424814,68.843221
...,...,...,...,...,...,...,...
2023-04-25,nifty50,17769.250000,ADANIENT,1844.599976,9.633118,105.424814,68.843221
2023-04-26,nifty50,17813.599609,ADANIENT,1847.900024,9.639915,105.424814,68.843221
2023-04-27,nifty50,17915.050781,ADANIENT,1853.050049,9.667872,105.424814,68.843221
2023-04-28,nifty50,18065.000000,ADANIENT,1924.949951,9.384660,105.424814,68.843221
2023-05-02,nifty50,18147.650391,ADANIENT,1950.949951,9.301956,105.424814,68.843221